Repository: mbcreation/wordpress-minimal-newsletter-subscription
Catalog: languages/minewsub-*.po
Languages: fr_fr

source: Subscription date
fr_fr: Date d'inscription

source: Export subscribers
fr_fr: Exporter les inscrits

source: You currently have %s subscribers.
fr_fr: Vous avez actuellement %s inscrits.

source: Email is mandatory
fr_fr: L'email est obligatoire

source: Email is not valid
fr_fr: Cet email n'est pas valide.

source: Email already registered
fr_fr: Cet email est déjà inscrit.

source: Register
fr_fr: S'inscrire

source: You successfully have been registered.
fr_fr: Votre inscription a bien été prise en compte.

source: Minimal newsletter subscription form
fr_fr: Formulaire d'inscription à la newsletter

source: Display a form to register to newsletter
fr_fr: Affiche le formulaire d'inscription à la newsletter
